// Dummy data for products
export const products = [
  {
    id: 1,
    name: "انگشتر سولیتر برلیان",
    price: 28000000,
    category: "انگشتر جواهر",
  },
  {
    id: 2,
    name: "انگشتر زمرد باگت",
    price: 45500000,
    category: "انگشتر جواهر",
  },
  {
    id: 3,
    name: "انگشتر یاقوت کبود",
    price: 32100000,
    category: "انگشتر جواهر",
  },
  {
    id: 4,
    name: "انگشتر فلاور با الماس",
    price: 68900000,
    category: "انگشتر جواهر",
  },
  {
    id: 5,
    name: "انگشتر پلاتین و مروارید",
    price: 19750000,
    category: "انگشتر طلا",
  },
  { id: 6, name: "انگشتر کلاسیک طلا", price: 12400000, category: "انگشتر طلا" },
  {
    id: 7,
    name: "انگشتر مدرن طلا سفید",
    price: 21300000,
    category: "انگشتر طلا",
  },
  {
    id: 8,
    name: "انگشتر طرح‌دار نگین‌دار",
    price: 39000000,
    category: "انگشتر نامزدی",
  },
  {
    id: 9,
    name: "انگشتر فیروزه نیشابور",
    price: 15600000,
    category: "انگشتر طلا",
  },
  {
    id: 10,
    name: "انگشتر زنانه جواهر",
    price: 55800000,
    category: "انگشتر جواهر",
  },
  {
    id: 11,
    name: "انگشتر طلای رزگلد",
    price: 18200000,
    category: "انگشتر طلا",
  },
  {
    id: 12,
    name: "انگشتر سلطنتی برلیان",
    price: 72400000,
    category: "انگشتر جواهر",
  },
  {
    id: 13,
    name: "انگشتر مردانه عقیق",
    price: 11500000,
    category: "انگشتر مردانه",
  },
  {
    id: 14,
    name: "انگشتر مردانه طرح شیر",
    price: 25000000,
    category: "انگشتر مردانه",
  },
  {
    id: 15,
    name: "انگشتر حلقه ست نامزدی",
    price: 42000000,
    category: "انگشتر نامزدی",
  },
];

export const filters = [
  "همه",
  "انگشتر طلا",
  "انگشتر جواهر",
  "انگشتر نامزدی",
  "انگشتر مردانه",
];

export const sorts = [
  "مرتب‌سازی پیش‌فرض",
  "قیمت: کم به زیاد",
  "قیمت: زیاد به کم",
];
